# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Terminal
brew "fish"
# Need to install Fisher manually
# https://github.com/jorgebucaran/fisher
brew "starship"


# Core Tools & Development
brew "cask"
brew "coreutils"
brew "direnv"
brew "docker"
brew "fzf"
brew "lsd"
brew "git"
brew "git-delta"
brew "git-machete"
brew "grep"
brew "ffmpeg"
brew "python"
brew "rtk"

# Neovim
brew "neovim"
brew "fd"
brew "ripgrep"
brew "lazygit"
brew "tree-sitter"

# Applications
cask "1password"
cask "arc"
cask "chromedriver"
cask "discord"
cask "docker"
cask "github"
cask "cursor"
cask "fork"
cask "boop"
cask "maccy"
cask "ngrok"
cask "notion"
cask "netnewswire"
cask "raycast"
cask "rectangle"
cask "slack"
cask "shottr"
cask "spotify"
cask "tomatobar"
cask "visual-studio-code"
cask "orbstack"
cask "keepingyouawake"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
