# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'grep'

# Applications
cask '1password'
cask 'discord'
cask 'docker'
cask 'github'
cask 'iterm2'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask "notion"
cask 'tomatobar'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-meslo-lg-nerd-font'