# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"

# Core Tools & Development
brew "cask"
brew "coreutils"
brew "direnv"
brew "docker"
brew "fzf"
brew "git"
brew "git-machete"
brew "grep"
brew "ffmpeg"
brew "python"

# Applications
cask "1password"
cask "arc"
cask "chromedriver"
cask "discord"
cask "docker"
cask "github"
cask "cursor"
cask "fork"
cask "iterm2"
cask "boop"
cask "maccy"
cask "ngrok"
cask "notion"
cask "netnewswire"
cask "raycast"
cask "rectangle"
cask "slack"
cask "shottr"
cask "spotify"
cask "tomatobar"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"